tutorials/incompressibleVoF/DTCHull/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-10 -6 -3) (10 0 3);
    }
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-5 -3 -2.5) (9 0 2);
    }
    {
        name    c3;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-3 -1.5 -1) (8 0 1.5);
    }
    {
        name    c4;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-2 -1 -0.6) (7 0 1);
    }
    {
        name    c5;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1 -0.6 -0.3) (6.5 0 0.8);
    }
    {
        name    c6;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.5 -0.55 -0.15) (6.25 0 0.65);
    }
);

// ************************************************************************* //
